---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterShape
source: html/0d9fa3b1-546c-5043-e257-f0139f41fdbc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterShape Property

"Baluster Shape"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRailingBalusterShape { get; }
```